## Data Filteration & Selection

In [1]:
import numpy as np
import pandas as pd

from pandas import DataFrame

In [10]:
df = pd.DataFrame(np.arange(0, 90,3).reshape(10,3), index = [f'row {i}' for i in range(1, 11)], columns = [f'C{i}' for i in range(1, 4)])
df

        C1  C2  C3
row 1    0   3   6
row 2    9  12  15
row 3   18  21  24
row 4   27  30  33
row 5   36  39  42
row 6   45  48  51
row 7   54  57  60
row 8   63  66  69
row 9   72  75  78
row 10  81  84  87

### Indexing

Indexing could be used to get values or set new values.  

**Methods of indexing:**
- **Normal**  
- **Boolean**

#### Normal

for single value: dataframe.iloc[row, column]  

for multiple values: dataframe.iloc[[row1, row2, ..], [col1, col2, col3, ...]]

In [15]:
df.iloc[0, 2]

np.int64(6)

In [16]:
df.iloc[0, 2] = 55
df

        C1  C2  C3
row 1    0   3  55
row 2    9  12  15
row 3   18  21  24
row 4   27  30  33
row 5   36  39  42
row 6   45  48  51
row 7   54  57  60
row 8   63  66  69
row 9   72  75  78
row 10  81  84  87

In [18]:
df.iloc[[2,6,8],[0,1]]

       C1  C2
row 3  18  21
row 7  54  57
row 9  72  75

In [36]:
#whole row
df.iloc[0, :]

C1     0
C2     3
C3    55
Name: row 1, dtype: int64

In [38]:
#whole column
df.iloc[:,0]

row 1      0
row 2      9
row 3     18
row 4     27
row 5     36
row 6     45
row 7     55
row 8     63
row 9     72
row 10    81
Name: C1, dtype: int64

#### Boolean

Uses comparison operators and masking to filter the dataframe.

Using the operators, a boolean dataframe is returned which is used as a mask.

In [19]:
df>20

           C1     C2     C3
row 1   False  False   True
row 2   False  False  False
row 3   False   True   True
row 4    True   True   True
row 5    True   True   True
row 6    True   True   True
row 7    True   True   True
row 8    True   True   True
row 9    True   True   True
row 10   True   True   True

In [25]:
df[df>20]

          C1    C2    C3
row 1    NaN   NaN  55.0
row 2    NaN   NaN   NaN
row 3    NaN  21.0  24.0
row 4   27.0  30.0  33.0
row 5   36.0  39.0  42.0
row 6   45.0  48.0  51.0
row 7   54.0  57.0  60.0
row 8   63.0  66.0  69.0
row 9   72.0  75.0  78.0
row 10  81.0  84.0  87.0

In [31]:
df[(df>50) & (df<60)]

          C1    C2    C3
row 1    NaN   NaN  55.0
row 2    NaN   NaN   NaN
row 3    NaN   NaN   NaN
row 4    NaN   NaN   NaN
row 5    NaN   NaN   NaN
row 6    NaN   NaN  51.0
row 7   54.0  57.0   NaN
row 8    NaN   NaN   NaN
row 9    NaN   NaN   NaN
row 10   NaN   NaN   NaN

In [32]:
df[(df>50) & (df<60)] = 55
df

        C1  C2  C3
row 1    0   3  55
row 2    9  12  15
row 3   18  21  24
row 4   27  30  33
row 5   36  39  42
row 6   45  48  55
row 7   55  55  60
row 8   63  66  69
row 9   72  75  78
row 10  81  84  87

###